## Concat DataFrames

In [7]:
import pandas as pd
India_weather=pd.DataFrame({
    "City":["Mumbai","Bangalore","Vizag"],
    "Temperature":[30,29,39]
})
India_weather

        City  Temperature
0     Mumbai           30
1  Bangalore           29
2      Vizag           39

In [8]:
US_weather=pd.DataFrame({
    "City":["New york","Chicago","Orlando"],
    "Temperature":[32,45,35]
})
US_weather

       City  Temperature
0  New york           32
1   Chicago           45
2   Orlando           35

In [9]:
df=pd.concat([India_weather,US_weather])
df

        City  Temperature
0     Mumbai           30
1  Bangalore           29
2      Vizag           39
0   New york           32
1    Chicago           45
2    Orlando           35

In [10]:
df=pd.concat([India_weather,US_weather],ignore_index=True)
df

        City  Temperature
0     Mumbai           30
1  Bangalore           29
2      Vizag           39
3   New york           32
4    Chicago           45
5    Orlando           35

In [11]:
df=pd.concat([India_weather,US_weather],axis=1)
df

        City  Temperature      City  Temperature
0     Mumbai           30  New york           32
1  Bangalore           29   Chicago           45
2      Vizag           39   Orlando           35

## Merge DataFrames

In [16]:
temp_df=pd.DataFrame({
    "City":["Hyderabad","Vijayawada","Chennai","vizag"],
    "Temperature":[34,42,38,29]
})
temp_df

         City  Temperature
0   Hyderabad           34
1  Vijayawada           42
2     Chennai           38
3       vizag           29

In [17]:
humidity_df=pd.DataFrame({
    "City":["Hyderabad","Vijayawada","Chennai","Bangalore"],
    "Humidity":[62,65,60,75]
})
humidity_df

         City  Humidity
0   Hyderabad        62
1  Vijayawada        65
2     Chennai        60
3   Bangalore        75

In [18]:
df=pd.merge(temp_df,humidity_df,on="City")
df

         City  Temperature  Humidity
0   Hyderabad           34        62
1  Vijayawada           42        65
2     Chennai           38        60

In [19]:
df=pd.merge(temp_df,humidity_df,on="City",how="outer")
df

         City  Temperature  Humidity
0   Bangalore          NaN      75.0
1     Chennai         38.0      60.0
2   Hyderabad         34.0      62.0
3  Vijayawada         42.0      65.0
4       vizag         29.0       NaN

In [20]:
df.isnull()

    City  Temperature  Humidity
0  False         True     False
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False      True

In [21]:
df.isnull().sum()

City           0
Temperature    1
Humidity       1
dtype: int64

In [30]:
df['Temperature']=df['Temperature'].fillna(df.Temperature.min())
df

         City  Temperature  Humidity
0   Bangalore         29.0      75.0
1     Chennai         38.0      60.0
2   Hyderabad         34.0      62.0
3  Vijayawada         42.0      65.0
4       vizag         29.0      75.0

In [31]:
df.isnull()

    City  Temperature  Humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False     False

In [32]:
df['Humidity']=df['Humidity'].fillna(df.Humidity.max())
df

         City  Temperature  Humidity
0   Bangalore         29.0      75.0
1     Chennai         38.0      60.0
2   Hyderabad         34.0      62.0
3  Vijayawada         42.0      65.0
4       vizag         29.0      75.0

In [33]:
df.isnull()

    City  Temperature  Humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False     False